<a href="https://colab.research.google.com/github/ankitarm/SQL_Data_Engineer/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# üîó[LeetCode 176 : Second Highest Salary](https://leetcode.com/problems/second-highest-salary/)

---
 üîπ Problem Statement

**Table: Employee**

| Column Name | Type |
|-------------|------|
| id          | int  |
| salary      | int  |

- `id` is the primary key.
- Each row in this table contains the salary of an employee.

---

 ‚úèÔ∏è Task

Write a SQL query to find the **second highest distinct salary** from the `Employee` table.  
If there is no second highest salary, return `null`.

---

 üì• Example 1

**Input:**

**Employee**

| id | salary |
|----|--------|
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

**Output:**

| SecondHighestSalary |
|---------------------|
| 200                 |

---

 üì• Example 2

**Input:**

**Employee**

| id | salary |
|----|--------|
| 1  | 100    |

**Output:**

| SecondHighestSalary |
|---------------------|
| null                |

---

 ‚úÖ SQL Solution

 - `OFFSET` to remove top n and `LIMIT` to keep n after OFFSET
 - Returns NULL if wntry doesnt exist.
```sql
SELECT (
    SELECT DISTINCT salary
    FROM Employee
    ORDER BY salary DESC
    LIMIT 1 OFFSET 1
) AS SecondHighestSalary;
```

 - Below query is `Incorrect` as Wont return NULL if entry doesn't exist.
 ```sql
SELECT DISTINCT salary AS SecondHighestSalary
FROM Employee
ORDER BY salary DESC
LIMIT 1 OFFSET 1;
```

# üîó[LeetCode 177 : Nth Highest Salary](https://leetcode.com/problems/nth-highest-salary/)

---

 üîπ Problem Statement

**Table: Employee**

| Column Name | Type |
| ----------- | ---- |
| id          | int  |
| salary      | int  |

* `id` is the primary key.
* Each row in this table contains the salary of an employee.

---

 ‚úèÔ∏è Task

Write a SQL query to find the **nth highest distinct salary** from the `Employee` table.
If there are less than `n` distinct salaries, return `null`.

---

 üì• Example 1

**Input:**

**Employee**

| id | salary |
| -- | ------ |
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

n = 2

**Output:**

| getNthHighestSalary(2) |
| ---------------------- |
| 200                    |

---

 üì• Example 2

**Input:**

**Employee**

| id | salary |
| -- | ------ |
| 1  | 100    |

n = 2

**Output:**

| getNthHighestSalary(2) |
| ---------------------- |
| null                   |

---

 ‚úÖ SQL Solution

* Uses `LIMIT` and `OFFSET` to skip the top (n-1) salaries and fetch the nth one
* `SELECT (...)` ensures it returns `null` when nth salary doesn‚Äôt exist

```sql
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
  SET N = N - 1;
  RETURN (
    SELECT DISTINCT salary
    FROM Employee
    ORDER BY salary DESC
    LIMIT 1 OFFSET N
  );
END

---

- We cannot use directly OFFSET N - !
- The output column name must be getNthHighestSalary(n) (which implies a function is being called).
```sql
SELECT DISTINCT salary
FROM Employee
ORDER BY salary DESC
LIMIT 1 OFFSET N - 1;

- Use DENSE_RANK() Version
```sql
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
  RETURN (
    SELECT salary
    FROM (
      SELECT salary, DENSE_RANK() OVER (ORDER BY salary DESC) AS rnk
      FROM Employee
    ) ranked
    WHERE rnk = N
    LIMIT 1
  );
END


| Data Size        | Recommended Query                  | Notes                            |
| ---------------- | ---------------------------------- | -------------------------------- |
| Small (< 100 GB) | `LIMIT` + `OFFSET`                 | Fast and lightweight             |
| Large (> 100 GB) | `DENSE_RANK()` via CTE or subquery | Scalable, better for performance |


# üîó[LeetCode 178 : Rank Scores](https://leetcode.com/problems/rank-scores/)


---

 üîπ Problem Statement

**Table: Scores**

| Column Name | Type    |
| ----------- | ------- |
| id          | int     |
| score       | decimal |

* `id` is the primary key.
* Each row contains a score from a game.
* `score` is a floating point number with two decimal places.

---

 ‚úèÔ∏è Task

Write a SQL query to rank scores from highest to lowest using the following rules:

* Scores are ranked in **descending order**.
* If two scores are the same, they receive the **same rank**.
* After a tie, the next rank should be the **next integer** (no gaps).

Return the result table **ordered by score descending**.

---

 üì• Example

**Input:**

**Scores**

| id | score |
| -- | ----- |
| 1  | 3.50  |
| 2  | 3.65  |
| 3  | 4.00  |
| 4  | 3.85  |
| 5  | 4.00  |

**Output:**

| score | rank |
| ----- | ---- |
| 4.00  | 1    |
| 4.00  | 1    |
| 3.85  | 2    |
| 3.65  | 3    |
| 3.50  | 4    |

---

 ‚úÖ SQL Solution

* Uses `DENSE_RANK()` to handle ties with no gaps.
* Orders results by `score` descending.

```sql
SELECT score,
DENSE_RANK() OVER(ORDER BY score DESC) AS 'rank'
FROM Scores;
```

---

#üîó[LeetCode 180 : Consecutive Numbers](https://leetcode.com/problems/consecutive-numbers/)

---

 üîπ Problem Statement

**Table: Logs**

| Column Name | Type |
| ----------- | ---- |
| id          | int  |
| num         | int  |

* `id` is the unique identifier representing order.
* `num` is the number recorded.

---

 ‚úèÔ∏è Task

Find all numbers that appear **at least 3 times consecutively** in the `Logs` table.

---

 üì• Example

**Input:**

| id | num |
| -- | --- |
| 1  | 1   |
| 2  | 1   |
| 3  | 1   |
| 4  | 2   |
| 5  | 2   |
| 6  | 3   |

**Output:**

| ConsecutiveNums |
| --------------- |
| 1               |

---

 ‚úÖ SQL Solutions

---

 Solution 1: Using Self-JOINs

```sql
SELECT DISTINCT L1.Num AS ConsecutiveNums
FROM Logs L1
JOIN Logs L2 ON L1.Id = L2.Id - 1
JOIN Logs L3 ON L1.Id = L3.Id - 2
WHERE L1.Num = L2.Num AND L2.Num = L3.Num;
```

---

 Solution 2: Using Window Functions (`LEAD` and `LAG`)

```sql
WITH L_L AS (
    SELECT num AS ConsecutiveNums,
           LEAD(num) OVER (ORDER BY id) AS Lead_val,
           LAG(num) OVER (ORDER BY id) AS Lag_val
    FROM Logs
)
SELECT DISTINCT ConsecutiveNums
FROM L_L
WHERE Lead_val = ConsecutiveNums AND Lag_val = ConsecutiveNums;
```

---

 ‚ö° Performance & Optimization Notes

| Approach             | Best For                       | Why?                                                                                                                                 |
| -------------------- | ------------------------------ | ------------------------------------------------------------------------------------------------------------------------------------ |
| **Self-JOINs**       | Smaller datasets (< 100K rows) | Simple joins work well with smaller data, easy to understand.                                                                        |
| **Window Functions** | Larger datasets (100K+ rows)   | Window functions are optimized for sequential data processing and avoid multiple joins, better for big data and distributed systems. |

---

 üîë Summary

* For **small datasets**, Self-JOINs are easy and fast enough.
* For **large datasets**, Window Functions (`LEAD`/`LAG`) scale better, reduce computation, and are preferred in modern SQL engines.

# üîó[LeetCode 181 : Employees Earning More Than Their Managers](https://leetcode.com/problems/employees-earning-more-than-their-managers/)

---

 üîπ Problem Statement

**Table: Employee**

| Column Name | Type    |
| ----------- | ------- |
| id          | int     |
| name        | varchar |
| salary      | int     |
| managerId   | int     |

* `id` is the primary key.
* `managerId` is the id of the employee‚Äôs manager.
* Each row contains an employee‚Äôs information including their salary and manager.

---

 ‚úèÔ∏è Task

Write a SQL query to find the names of employees who earn more than their managers.

---

 üì• Example

**Input:**

**Employee**

| id | name  | salary | managerId |
| -- | ----- | ------ | --------- |
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | NULL      |
| 4  | Max   | 90000  | NULL      |
| 5  | Janet | 69000  | 3         |
| 6  | Randy | 85000  | 4         |

**Output:**

| name  |
| ----- |
| Joe   |
| Randy |

---

 ‚úÖ SQL Solution

* Self-join `Employee` table to compare employee salaries with their manager‚Äôs salaries.

```sql
SELECT e.name
FROM Employee e
JOIN Employee m ON e.managerId = m.id
WHERE e.salary > m.salary;
```

---

# üîó[LeetCode 182 : Duplicate Emails](https://leetcode.com/problems/duplicate-emails/)

---

 üîπ Problem Statement

**Table: Person**

| Column Name | Type    |
| ----------- | ------- |
| id          | int     |
| email       | varchar |

* `id` is the primary key.
* Each row contains the email of a person.

---

 ‚úèÔ∏è Task

Write a SQL query to find all **duplicate emails** in the `Person` table.
Return the emails that appear **more than once**.

---

 üì• Example

**Input:**

**Person**

| id | email                                       |
| -- | ------------------------------------------- |
| 1  | [john@example.com](mailto:john@example.com) |
| 2  | [bob@example.com](mailto:bob@example.com)   |
| 3  | [john@example.com](mailto:john@example.com) |

**Output:**

| Email                                       |
| ------------------------------------------- |
| [john@example.com](mailto:john@example.com) |

---

 ‚úÖ SQL Solution

* Use `GROUP BY` and `HAVING` to find emails appearing more than once.

```sql
SELECT email
FROM Person
GROUP BY email
HAVING COUNT(email) > 1;
```

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

| Dataset Size                | Behavior & Considerations                                                                                                                                                                                                                                  |
| --------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| **< 100 GB (Small/Medium)** | Query runs efficiently if there's an index on `email`. `GROUP BY` and aggregation execute quickly. Can be handled in-memory or with modest disk I/O.                                                                                                       |
| **> 100 GB (Large)**        | Requires distributed processing or optimized execution. Without indexes, grouping large datasets can be expensive (high I/O, memory usage). Use partitioning, indexing, or distributed SQL engines (e.g., Hive, Presto, Spark SQL) to improve performance. |

---

https://leetcode.com/problems/customers-who-never-order/

#  üîó[LeetCode 183 : Customers Who Never Order](https://leetcode.com/problems/customers-who-never-order/)

---

 üîπ Problem Statement

**Table: Customers**

| Column Name | Type    |
| ----------- | ------- |
| id          | int     |
| name        | varchar |

* `id` is the primary key for this table.
* Each row represents a customer.

**Table: Orders**

| Column Name | Type |
| ----------- | ---- |
| id          | int  |
| customerId  | int  |

* `id` is the primary key for this table.
* `customerId` is a foreign key to `Customers.id`.

---

 ‚úèÔ∏è Task

Write a SQL query to find all customers who **never placed an order**.

---

 üì• Example

**Input:**

**Customers**

| id | name  |
| -- | ----- |
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |

**Orders**

| id | customerId |
| -- | ---------- |
| 1  | 3          |
| 2  | 1          |

**Output:**

| Customers |
| --------- |
| Henry     |
| Max       |

---

 ‚úÖ SQL Solutions

 üîπ Solution 1: `LEFT JOIN` with `IS NULL`

* Joins all customers with orders, and filters where no matching order exists.

```sql
SELECT c.name AS Customers
FROM Customers c
LEFT JOIN Orders o ON c.id = o.customerId
WHERE o.id IS NULL;
```

---

 üîπ Solution 2: `NOT IN` subquery

* Selects customers whose IDs are **not in** the list of customer IDs in Orders.

```sql
SELECT name AS Customers
FROM Customers
WHERE id NOT IN (
    SELECT customerId FROM Orders
);
```

‚ö†Ô∏è *Note:* If `customerId` in `Orders` can be `NULL`, this might cause unexpected behavior. Use `NOT EXISTS` for safer logic.

---

 üîπ Solution 3: `NOT EXISTS` correlated subquery

* Checks for absence of matching records using a correlated subquery.
* 1 if exist and ignore, else print name.


```sql
SELECT name AS Customers
FROM Customers c
WHERE NOT EXISTS (
    SELECT 1
    FROM Orders o
    WHERE o.customerId = c.id
);
```

‚úÖ *Best practice when working with large datasets or when `NULL`s might exist.*

---

#  üîó[LeetCode 184 : Department Highest Salary](https://leetcode.com/problems/department-highest-salary/)

---

 üîπ Problem Statement

**Table: Employee**

| Column Name  | Type    |
| ------------ | ------- |
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |

**Table: Department**

| Column Name | Type    |
| ----------- | ------- |
| id          | int     |
| name        | varchar |

* `id` is the primary key in both tables.
* `departmentId` in `Employee` is a foreign key to `Department.id`.

---

 ‚úèÔ∏è Task

Write a SQL query to find employees who have the **highest salary** in each department.
Return the department name, employee name, and salary.

---

 üì• Example

**Input:**

**Employee**

| id | name  | salary | departmentId |
| -- | ----- | ------ | ------------ |
| 1  | Joe   | 70000  | 1            |
| 2  | Jim   | 90000  | 1            |
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |

**Department**

| id | name  |
| -- | ----- |
| 1  | IT    |
| 2  | Sales |

**Output:**

| Department | Employee | Salary |
| ---------- | -------- | ------ |
| IT         | Jim      | 90000  |
| IT         | Max      | 90000  |
| Sales      | Henry    | 80000  |

---

 ‚úÖ SQL Solutions

 üîπ Solution 1: Correlated Subquery

```sql
SELECT d.name AS Department, e.name AS Employee, e.salary AS Salary
FROM Employee e
JOIN Department d ON e.departmentId = d.id
WHERE e.salary = (
    SELECT MAX(salary)
    FROM Employee
    WHERE departmentId = e.departmentId
);
```

‚úÖ **Important Points:**

* Uses a **correlated subquery** to find the max salary per department.
* Ensures employees with **tied top salaries** are also included.
* Simple and readable; works well for moderate datasets.

---

 üîπ Solution 2: Common Table Expression (CTE) with `DENSE_RANK()`

```sql
WITH RankedSalaries AS (
    SELECT e.name AS Employee, e.salary AS Salary, d.name AS Department,
           DENSE_RANK() OVER (PARTITION BY e.departmentId ORDER BY e.salary DESC) AS rnk
    FROM Employee e
    JOIN Department d ON e.departmentId = d.id
)
SELECT Department, Employee, Salary
FROM RankedSalaries
WHERE rnk = 1;
```

‚úÖ **Important Points:**

* Uses `DENSE_RANK()` to rank salaries within each department.
* Cleaner and more powerful if you plan to extend logic (e.g., top 3 salaries).
* Handles ties automatically.

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

<table>
  <thead>
    <tr>
      <th style="width: 40%; word-wrap: break-word; white-space: normal;">Dataset Size</th>
      <th style="width: 60%; word-wrap: break-word; white-space: normal;">Behavior &amp; Considerations</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&lt; 100 GB (Small/Medium)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Both solutions run efficiently. Use indexes on <code>departmentId</code> and <code>salary</code> to speed up subqueries or window functions. Most SQL engines will optimize correlated subqueries well.
      </td>
    </tr>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&gt; 100 GB (Large)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Prefer the <code>DENSE_RANK()</code> solution for better performance in distributed engines. Correlated subqueries can become expensive due to repeated execution. Use partitioned tables and columnar storage (e.g., Parquet, ORC) with engines like Hive, Presto, or Spark SQL.
      </td>
    </tr>
  </tbody>
</table>

---

Let me know if you'd like to add optimizations or an explanation for interview discussion!

#  üîó[LeetCode 185 : Department Top Three Salaries](https://leetcode.com/problems/department-top-three-salaries/)

---

 üîπ Problem Statement

**Table: Employee**

| Column Name  | Type    |
| ------------ | ------- |
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |

**Table: Department**

| Column Name | Type    |
| ----------- | ------- |
| id          | int     |
| name        | varchar |

* `id` is the primary key in both tables.
* `departmentId` is a foreign key to `Department.id`.

---

 ‚úèÔ∏è Task

Write a SQL query to find the **top three highest distinct salaries** in each department.
Return the **department name**, **employee name**, and **salary**.

---

 üì• Example

**Input:**

**Employee**

| id | name  | salary | departmentId |
| -- | ----- | ------ | ------------ |
| 1  | Joe   | 85000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
| 5  | Janet | 69000  | 1            |
| 6  | Randy | 85000  | 1            |

**Department**

| id | name  |
| -- | ----- |
| 1  | IT    |
| 2  | Sales |

**Output:**

| Department | Employee | Salary |
| ---------- | -------- | ------ |
| IT         | Joe      | 85000  |
| IT         | Max      | 90000  |
| IT         | Randy    | 85000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |

---

 ‚úÖ SQL Solutions

 üîπ Solution: `DENSE_RANK()` with CTE

```sql
WITH RankedSalaries AS (
  SELECT d.name AS Department,
         e.name AS Employee,
         e.salary AS Salary,
         DENSE_RANK() OVER (
             PARTITION BY e.departmentId
             ORDER BY e.salary DESC
         ) AS rnk
  FROM Employee e
  JOIN Department d ON e.departmentId = d.id
)
SELECT Department, Employee, Salary
FROM RankedSalaries
WHERE rnk <= 3;
```

‚úÖ **Important Points:**

* Uses `DENSE_RANK()` to ensure duplicate salaries are ranked correctly.
* `PARTITION BY departmentId` restricts ranking within each department.
* Highly readable and extendable for top-N salaries (just change `rnk <= 3`).

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

<table>
  <thead>
    <tr>
      <th style="width: 40%; word-wrap: break-word; white-space: normal;">Dataset Size</th>
      <th style="width: 60%; word-wrap: break-word; white-space: normal;">Behavior &amp; Considerations</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&lt; 100 GB (Small/Medium)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Performs efficiently on most RDBMS engines. Index on <code>departmentId</code> and <code>salary</code> boosts performance. Query fits well in memory.
      </td>
    </tr>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&gt; 100 GB (Large)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Window functions like <code>DENSE_RANK()</code> scale well in distributed SQL engines (e.g., Spark SQL, Presto). Partitioning and columnar formats like Parquet improve performance. Avoid nested subqueries; prefer CTEs and windowing.
      </td>
    </tr>
  </tbody>
</table>

---

 üîÅ Alternate SQL Solution (Using Subqueries & `IN`)

```sql
SELECT d.name AS Department, e.name AS Employee, e.salary AS Salary
FROM Employee e
JOIN Department d ON e.departmentId = d.id
WHERE (
    SELECT COUNT(DISTINCT e2.salary)
    FROM Employee e2
    WHERE e2.departmentId = e.departmentId
      AND e2.salary > e.salary
) < 3;
```

‚úÖ **Important Points:**

* This subquery counts how many **distinct higher salaries** exist in the same department.
* If fewer than 3 higher salaries exist, that means this salary is in the **top 3**.
* Handles **ties** correctly because it uses `DISTINCT` in the count.
* Avoids window functions; suitable for engines with limited analytic function support.

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

<table>
  <thead>
    <tr>
      <th style="width: 40%; word-wrap: break-word; white-space: normal;">Dataset Size</th>
      <th style="width: 60%; word-wrap: break-word; white-space: normal;">Behavior &amp; Considerations</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&lt; 100 GB (Small/Medium)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Performs reasonably well. Query is readable and doesn‚Äôt require window function support. Indexes on <code>departmentId</code> and <code>salary</code> recommended for better performance.
      </td>
    </tr>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&gt; 100 GB (Large)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Subqueries may run slower due to repeated scans per row. Avoid in distributed systems. Prefer window function approach with <code>DENSE_RANK()</code> in large-scale or big data environments.
      </td>
    </tr>
  </tbody>
</table>

---

#  üîó[LeetCode 196 : Delete Duplicate Emails](https://leetcode.com/problems/delete-duplicate-emails/)

---

 üîπ Problem Statement

**Table: Person**

| Column Name | Type    |
| ----------- | ------- |
| id          | int     |
| email       | varchar |

* `id` is the primary key.
* Each row in the table has a person‚Äôs email.
* Some emails may appear more than once with different `id`s.

---

 ‚úèÔ∏è Task

Write a SQL query to **delete all duplicate emails**, keeping only the record with the **smallest id** for each email.

---

 üì• Example

**Input:**

**Person**

| id | email                                       |
| -- | ------------------------------------------- |
| 1  | [john@example.com](mailto:john@example.com) |
| 2  | [bob@example.com](mailto:bob@example.com)   |
| 3  | [john@example.com](mailto:john@example.com) |

**Output After Deletion:**

| id | email                                       |
| -- | ------------------------------------------- |
| 1  | [john@example.com](mailto:john@example.com) |
| 2  | [bob@example.com](mailto:bob@example.com)   |

---

 ‚úÖ SQL Solutions

 üîπ Solution 1: Subquery with `NOT IN`

```sql
DELETE FROM Person
WHERE id NOT IN (
  SELECT minid
  FROM (
    SELECT MIN(id) AS minid
    FROM Person
    GROUP BY email
  ) AS A
);
```

‚úÖ **Important Points:**

Understanding MySQL's Limitation
In MySQL, you cannot directly delete rows while selecting from the same table in a subquery. If you try this query:

DELETE FROM Person
WHERE Id NOT IN (SELECT MIN(Id) FROM Person GROUP BY Email);
It may throw the error:

"You can't specify target table 'Person' for update in FROM clause"
* Keeps only the **smallest id** per email by using `GROUP BY`.
* Deletes all other entries **not in the minimum id list**.
* Safe from MySQL error by wrapping inner query in a derived table.

---

 üîπ Solution 2: Window Function with `ROW_NUMBER()` (if supported)

```sql
WITH RankedEmails AS (
  SELECT id, ROW_NUMBER() OVER (PARTITION BY email ORDER BY id) AS rn
  FROM Person
)
DELETE FROM Person
WHERE id IN (
  SELECT id FROM RankedEmails WHERE rn > 1
);
```

‚úÖ **Important Points:**

* Assigns a unique row number to each email group.
* Deletes all rows with `rn > 1`, keeping the one with `rn = 1`.
* Requires support for **common table expressions** and **window functions** (not all RDBMS allow DELETE from CTE).

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

<table>
  <thead>
    <tr>
      <th style="width: 40%; word-wrap: break-word; white-space: normal;">Dataset Size</th>
      <th style="width: 60%; word-wrap: break-word; white-space: normal;">Behavior &amp; Considerations</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&lt; 100 GB (Small/Medium)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Both solutions run efficiently. Index on <code>email</code> helps speed up grouping. DELETE operations are manageable.
      </td>
    </tr>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&gt; 100 GB (Large)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Subquery version more compatible across systems but less optimized. Window function version is faster in modern engines (e.g., BigQuery, Snowflake, PostgreSQL, SQL Server). For massive deletes, consider staging tables or batch deletes.
      </td>
    </tr>
  </tbody>
</table>

---

#  üîó[LeetCode 197 : Rising Temperature](https://leetcode.com/problems/rising-temperature/)

---

 üîπ Problem Statement

**Table: Weather**

| Column Name | Type |
| ----------- | ---- |
| id          | int  |
| recordDate  | date |
| temperature | int  |

* `id` is the primary key.
* Each row contains the temperature on a specific date.

---

 ‚úèÔ∏è Task

Write a SQL query to find all dates' IDs where the temperature was **higher than the previous day's** temperature.

---

 üì• Example

**Input:**

**Weather**

| id | recordDate | temperature |
| -- | ---------- | ----------- |
| 1  | 2020-01-01 | 10          |
| 2  | 2020-01-02 | 25          |
| 3  | 2020-01-03 | 20          |
| 4  | 2020-01-04 | 30          |

**Output:**

| id |
| -- |
| 2  |
| 4  |

---

 ‚úÖ SQL Solutions

 üîπ Solution 1: Self Join

```sql
SELECT w1.id
FROM Weather w1
JOIN Weather w2
  ON DATEDIFF(w1.recordDate, w2.recordDate) = 1
WHERE w1.temperature > w2.temperature;
```

‚úÖ **Important Points:**

Joins the weather table to itself.
DATEDIFF(w1.recordDate, w2.recordDate) = 1 ensures that w1 is the day after w2.
Then it checks if w1.temperature > w2.temperature ‚Äî i.e., today's temperature is higher than yesterday's.

* Uses `DATEDIFF()` to match a row with its previous day's row.
* Simple, portable query ‚Äî works in MySQL and other engines.
* Assumes data has no missing dates. If some dates are missing, results are limited to existing 1-day gaps.

---

 üîπ Solution 2: Window Function (`LAG()`)

```sql
SELECT id
FROM (
  SELECT id, temperature,
         LAG(temperature) OVER (ORDER BY recordDate) AS prev_temp
  FROM Weather
) AS temp_table
WHERE temperature > prev_temp;
```

‚úÖ **Important Points:**

* Uses `LAG()` to access the previous row‚Äôs temperature.
* More robust than join‚Äîdoesn‚Äôt rely on exact 1-day date differences.
* Requires SQL engine support for window functions (e.g., PostgreSQL, SQL Server, Snowflake, etc.)

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

<table>
  <thead>
    <tr>
      <th style="width: 40%; word-wrap: break-word; white-space: normal;">Dataset Size</th>
      <th style="width: 60%; word-wrap: break-word; white-space: normal;">Behavior &amp; Considerations</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&lt; 100 GB (Small/Medium)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Both queries work efficiently. Index on <code>recordDate</code> speeds up self join and window functions. Ideal for standard datasets.
      </td>
    </tr>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&gt; 100 GB (Large)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Window function version scales better in distributed systems (e.g., Spark SQL, BigQuery). Self joins may be more expensive due to data shuffling and sorting. Partitioned data and columnar storage improve performance.
      </td>
    </tr>
  </tbody>
</table>

---

#üîó[LeetCode 262 : Trips and Users](https://leetcode.com/problems/trips-and-users/)

---

 üîπ Problem Statement

**Table: Trips**

| Column Name | Type |
| ----------- | ---- |
| id          | int  |
| client\_id  | int  |
| driver\_id  | int  |
| city\_id    | int  |
| status      | enum |
| request\_at | date |

* `id` is the primary key.
* `client_id`, `driver_id`, and `city_id` are foreign keys.
* `status` is an ENUM with values like: `'completed'`, `'cancelled_by_driver'`, `'cancelled_by_client'`.

**Table: Users**

| Column Name | Type |
| ----------- | ---- |
| users\_id   | int  |
| banned      | enum |
| role        | enum |

* `users_id` is the primary key.
* `banned` is an ENUM with values `'Yes'` or `'No'`.
* `role` is an ENUM with values `'client'` or `'driver'`.

---

 ‚úèÔ∏è Task

Write a SQL query to find the **cancellation rate** for each day between **2013-10-01 to 2013-10-03**, **excluding** trips where **clients or drivers were banned**.

Cancellation Rate =

> Number of trips with status LIKE 'cancelled%' / Total valid trips for that day

---

 üì• Example

**Input:**

**Trips**

| id | client\_id | driver\_id | city\_id | status                | request\_at |
| -- | ---------- | ---------- | -------- | --------------------- | ----------- |
| 1  | 1          | 10         | 1        | completed             | 2013-10-01  |
| 2  | 2          | 11         | 1        | cancelled\_by\_driver | 2013-10-01  |
| 3  | 3          | 12         | 6        | completed             | 2013-10-01  |
| 4  | 4          | 13         | 6        | cancelled\_by\_client | 2013-10-01  |
| 5  | 1          | 10         | 1        | completed             | 2013-10-02  |
| 6  | 2          | 11         | 6        | completed             | 2013-10-02  |
| 7  | 3          | 12         | 6        | completed             | 2013-10-02  |
| 8  | 2          | 12         | 12       | completed             | 2013-10-03  |
| 9  | 3          | 10         | 12       | completed             | 2013-10-03  |
| 10 | 4          | 13         | 12       | completed             | 2013-10-03  |

**Users**

| users\_id | banned | role   |
| --------- | ------ | ------ |
| 1         | No     | client |
| 2         | Yes    | client |
| 3         | No     | client |
| 4         | No     | client |
| 10        | No     | driver |
| 11        | Yes    | driver |
| 12        | No     | driver |
| 13        | No     | driver |

**Output:**

| Day        | Cancellation Rate |
| ---------- | ----------------- |
| 2013-10-01 | 0.50              |
| 2013-10-02 | 0.00              |
| 2013-10-03 | 0.00              |

---

 ‚úÖ SQL Solutions

 üîπ Solution 1: JOINs with Filtering and Aggregation

```sql
SELECT request_at AS Day,
       ROUND(SUM(CASE WHEN status LIKE 'cancelled%' THEN 1 ELSE 0 END) / COUNT(*), 2) AS "Cancellation Rate"
FROM Trips t
JOIN Users c ON t.client_id = c.users_id AND c.banned = 'No'
JOIN Users d ON t.driver_id = d.users_id AND d.banned = 'No'
WHERE request_at BETWEEN '2013-10-01' AND '2013-10-03'
GROUP BY request_at
ORDER BY request_at;
```

‚úÖ **Important Points:**

* Filters out **banned clients and drivers** using two joins.
* Uses `SUM + CASE` to count canceled trips.
* `ROUND(..., 2)` gives precision up to 2 decimals.

---

 üîπ Solution 2: CTE with `NOT IN`

```sql
WITH Banned AS (
  SELECT users_id FROM Users WHERE banned = 'Yes'
)
SELECT request_at AS Day,
       ROUND(SUM(CASE WHEN status LIKE 'cancelled%' THEN 1 ELSE 0 END) / COUNT(*), 2) AS "Cancellation Rate"
FROM Trips
WHERE client_id NOT IN (SELECT users_id FROM Banned)
  AND driver_id NOT IN (SELECT users_id FROM Banned)
  AND request_at BETWEEN '2013-10-01' AND '2013-10-03'
GROUP BY request_at
ORDER BY request_at;
```

‚úÖ **Important Points:**

* Creates a temp banned user list.
* Filters out banned users using `NOT IN`.
* Easier to read; slightly less efficient on large datasets compared to joins with indexes.

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

<table>
  <thead>
    <tr>
      <th style="width: 40%; word-wrap: break-word; white-space: normal;">Dataset Size</th>
      <th style="width: 60%; word-wrap: break-word; white-space: normal;">Behavior &amp; Considerations</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&lt; 100 GB (Small/Medium)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Both queries run efficiently. Ensure indexes on <code>users_id</code>, <code>client_id</code>, <code>driver_id</code>, and <code>request_at</code> for best performance.
      </td>
    </tr>
    <tr>
      <td style="word-wrap: break-word; white-space: normal;">&gt; 100 GB (Large)</td>
      <td style="word-wrap: break-word; white-space: normal;">
        Prefer the <code>JOIN</code> approach with indexed columns. <code>NOT IN</code> subqueries can become slow on large data unless transformed to <code>NOT EXISTS</code> or joins. Use partitioned tables and columnar storage in big data systems.
      </td>
    </tr>
  </tbody>
</table>

Indexing

To **optimize this query**, the **best columns to index** are:

---

 ‚úÖ Recommended Indexes:

 1. `Users.banned`

* **Why**: You're filtering with `WHERE banned = 'Yes'` in the `Banned` CTE.
* **Type**: `CREATE INDEX idx_users_banned ON Users(banned);`
* **Effect**: Speeds up the filtering of banned users.

---

 2. `Trips.client_id` and `Trips.driver_id`

* **Why**: You're using both in `NOT IN (SELECT users_id FROM Banned)`.
* **Type**:

  ```sql
  CREATE INDEX idx_trips_client_id ON Trips(client_id);
  CREATE INDEX idx_trips_driver_id ON Trips(driver_id);
  ```
* **Effect**: Makes it faster to filter trips based on whether the client or driver is in the banned list.

---

 3. `Trips.request_at`

* **Why**: You're filtering on a **date range** using `BETWEEN` and grouping/ordering by it.
* **Type**:

  ```sql
  CREATE INDEX idx_trips_request_at ON Trips(request_at);
  ```
* **Effect**: Speeds up date range filtering and sorting.

---

 ‚úÖ Optional: Composite Index

If the table is large and you frequently run **this exact query**, a **composite index** may be even better:

```sql
CREATE INDEX idx_trips_request_client_driver
ON Trips(request_at, client_id, driver_id);
```

* **Why**: Helps with filtering by `request_at`, `client_id`, `driver_id` all at once.
* **Note**: Use composite indexes **only when the columns are often queried together**.

---

 ‚ö†Ô∏è Important Notes:

* Avoid over-indexing ‚Äî each index takes space and slows down `INSERT/UPDATE/DELETE`.
* Use **`EXPLAIN` or `QUERY PLAN`** to check whether your indexes are being used.

#  üîó [LeetCode 550: Game Play Analysis IV](https://leetcode.com/problems/game-play-analysis-iv)

---

 üîπ Problem Statement

**Table: Activity**

| Column Name   | Type |
| ------------- | ---- |
| player\_id    | int  |
| device\_id    | int  |
| event\_date   | date |
| games\_played | int  |

* This table shows the **activity** of players of some games.
* Each row is a record of a player who logged in and played some games using some device on `event_date`.
* The **first login** date for each player is **the earliest date** they appear in this table.

---

 ‚úèÔ∏è Task

Write a SQL query to **report the fraction of players** that **logged in again on the day after** the day they first logged in, **rounded to 2 decimal places**.

---

 üì• Example Input

**Activity**

| player\_id | device\_id | event\_date | games\_played |
| ---------- | ---------- | ----------- | ------------- |
| 1          | 2          | 2016-03-01  | 5             |
| 1          | 2          | 2016-03-02  | 6             |
| 2          | 3          | 2017-06-25  | 1             |
| 3          | 1          | 2016-03-01  | 0             |
| 3          | 4          | 2016-03-02  | 0             |
| 4          | 1          | 2016-03-01  | 0             |
| 5          | 3          | 2019-06-30  | 2             |
| 5          | 3          | 2019-07-01  | 1             |

---

 ‚úÖ SQL Solution 1: Using CTE and Self-Join

```sql
SELECT
  ROUND(COUNT(DISTINCT a1.player_id) * 1.0 / COUNT(DISTINCT a2.player_id), 2) AS fraction
FROM
  (SELECT player_id, MIN(event_date) AS first_login FROM Activity GROUP BY player_id) a2
LEFT JOIN
  Activity a1
ON
  a1.player_id = a2.player_id AND a1.event_date = DATE_ADD(a2.first_login, INTERVAL 1 DAY);
```

 üî∏ Important Points:

* Finds first login date for each player using `MIN()`.
* Joins to check if a record exists for `first_login + 1`.
* Divides count of players who logged in on the next day by total players.

---

 ‚úÖ SQL Solution 2: Using Subquery and Filtering

```sql
SELECT
  ROUND(SUM(CASE WHEN event_date = DATE_ADD(first_day, INTERVAL 1 DAY) THEN 1 ELSE 0 END) / COUNT(*), 2) AS fraction
FROM (
    SELECT
      player_id,
      MIN(event_date) AS first_day
    FROM Activity
    GROUP BY player_id
) init
JOIN Activity a ON a.player_id = init.player_id;
```

 üî∏ Important Points:

* Computes first login date per player.
* Joins back and checks if player logged in on `first_day + 1`.
* Uses conditional aggregation.

---

 ‚öôÔ∏è Behavior on Different Dataset Sizes

| Dataset Size            | Behavior & Considerations                                                                                                                                              |
| ----------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| < 100 GB (Small/Medium) | Query performs well with indexes on `player_id` and `event_date`. MIN and JOIN are efficient.                                                                          |
| > 100 GB (Large)        | Needs indexing and query engine optimization. Use partitioning on `event_date`. Distributed engines like BigQuery, Spark SQL, or Redshift recommended for performance. |

optimized..
```
SELECT
  ROUND(
    COUNT(DISTINCT a.player_id) * 1.0 /
    (SELECT COUNT(DISTINCT player_id) FROM Activity),
    2
  ) AS fraction
FROM Activity a
WHERE EXISTS (
  SELECT 1
  FROM Activity b
  WHERE a.player_id = b.player_id
    AND DATEDIFF(b.event_date, a.event_date) = 1
)
AND a.event_date = (
  SELECT MIN(event_date)
  FROM Activity
  WHERE player_id = a.player_id
);
```